01_Dummy_cases/02_A02_Rotor/03_MRF/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 288.15;
inletTemperature uniform 288.15;

boundaryField
{
    "(HUB|SHROUD|BLADE)"
    {
        type            zeroGradient;
    }

    "(PER_1|PER_2)"
    {
        type            cyclicAMI;   
    }

    INLET
    {
        type        fixedValue;    
	value	    $inletTemperature;
    }
	
    OUTLET
    {

        type            zeroGradient;

    }
}

// ************************************************************************* //